---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionArea
source: html/568c100d-245b-f420-f772-60852795c33d.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionArea Property

Cross section area.

## Syntax (C#)
```csharp
public double SectionArea { get; set; }
```